<template>
	<div class="epub-index-wrap">
    <div id="touch-wrap">
        <v-touch class="l" @tap="ePubPrev()" @swipeleft="ePubPrev()"></v-touch>
        <v-touch class="c" id="touch-center" @tap="ifClickHidden()"></v-touch>
        <v-touch class="r" @tap="ePubNext()" @swipeleft="ePubNext()"></v-touch>
    </div>
    
    <div id="ePubArea"></div>
    
    
    <div id="toc-wrap">
      <ul id="toc"></ul>
    </div>

    <!-- 我的书架(原) -->
		<!-- <mt-button type="primary" class="add-book" v-if="!books.length" @click="$emit('addBook','分类')">添加小说</mt-button>
		<ul class="book-shelf" v-if="books.length">
			<v-touch tag="li" class="book-list-wrap" v-for="(book, index) in books" :key="index" @swipeleft="showDelBookBtn" @swiperight="hideDelBookBtn">
				<v-touch class="book-list" @tap="readbook(book)">
					<div class="read-book-history">
						<img :src="book.cover">
						<div class="info">
							<p class="title">{{book.title}}</p>
              <p>{{book.lastChapter}}</p>
							<p class="updated">{{book.updated}}</p>
						</div>
					</div>
					<v-touch class="del-book-btn" @tap="delBook($event,index)">删除</v-touch>
				</v-touch>
			</v-touch>
		</ul> -->
	</div>
</template>

<script>
import api from '@/api/api'
import moment from 'moment'
import util from '@/utils/util'
import aes from '@/utils/aes'
import { SET_EPUB_BOOK,SET_CURRENT_SOURCE, SET_READ_BOOK } from '@/store/mutationsType'
import { Indicator } from 'mint-ui'

moment.locale('zh-cn')
export default {
  name: 'Bookshelf',
  data () {
    return {
      books: [],
      rendition:{},
      ifHiddenFlag:true,
      displayed:'',
      epubText:''
    }
  },
  filters: {
    /**
    * 使用moment格式化时间
    */
    ago (time) {
      return moment(time).fromNow()
    }
  },
  created () {
    this.getBookUpdate()
  },
  mounted () {
    this.ePubStream()
    // this.epubLoad()
    // this.testAES()
    // this.clickHidden();
  },
  methods: {
    
    ifClickHidden(){
      let _that,_ul,_header,_ePubPrev,_ePubNext

      _that = this
      _that.ifHiddenFlag = !_that.ifHiddenFlag

      _ul = document.getElementById('toc-wrap')
      _header = document.getElementsByClassName('mint-header')[0]
      _ePubNext = document.getElementById('ePubNext')
      _ePubPrev = document.getElementById('ePubPrev')

      if (_that.ifHiddenFlag) {
        _ul.classList.add('boxHidden')
        _header.style.transform = "translateY(-100%)"
        _header.style.transition = "all .3s ease-out"
      } else {
        _ul.classList.remove('boxHidden')
        _header.style.transform = "translateY(0)"
        _header.style.transition = "all .3s ease-in"
      }
      
    },
    ePubStream () {
      // this.$http.get('http://124.204.40.3:50696/content/authorize')
      // this.$http.get('http://124.204.40.3:50693/files/encrypted/7b4/90ef9e4c301a4f62af50d92fdd744118_0_427052_encrypted.epub')
         
      $.ajax({
        type:'post',
        url:'http://124.204.40.3:50696/content/authorize',
        data:{
          authorzieParameters: JSON.stringify({
            contentexternalid: '29552-Epub',
            device: {
                devicekey: 'tb)DPkFKpWJ5H7uL',
                DeviceType: 4,
                Title: "测试"
            },
            FromSalePlatformTitle: "建工",
            userinfo: {
                nickname:"未登录",
                ExternalId:"未登录"
            }
          })        
        },
        success:function(data){
          let epubUrl,zip,book,render,ePubKey,decryptObj,devicekey,getEpubU8,encryptu8,decryptu8,epubLocation

          // 从返回结果里得到epub地址
          // epubUrl = data.Data.Url
          // 测试Epub地址
          epubUrl = 'http://demo.cabpv2.api.kingchannels.cn/files/test/test.epub'
          // 声明一个新的zip
          zip = new JSZip()
          // 声明一个新的epub对象，并使用base64/blob来替换静态资源选项
          book = new ePub(epubUrl,{ replacements: "blob" })
          // 拿到加密的key字符串
          ePubKey = data.Data.Key
          // devicekey
          devicekey = 'tb)DPkFKpWJ5H7uL'
          // 真实解密得到的key
          // decryptObj = aes.decrypt(ePubKey,devicekey)
          // 模拟密钥
          decryptObj = '^4fSY0aUwPl8%Buv'
          // console.log(decryptObj1,decryptObj2,'解密key得到的结果')
          //判断档案是否存在
          book.opened.then(content => {
            if (content.archive) {
              getEpubU8 = content.archive.zip.folder("OPS").file("chapter14.xhtml").async('uint8array')
              getEpubU8.then(u8 => {
                encryptu8 = window.btoa(String.fromCharCode.apply(null, u8))
                // console.log(encryptu8,'解密前的u8转成的base64')
                decryptu8 = aes.decrypt(encryptu8,decryptObj)
                // console.log(decryptu8,'解密返回的结果')
              })
            }
          })

          // 渲染到DOM并执行
          // render = book.renderTo("ePubArea",{width: "100vw"}) 
          render.display()

          // key的key
          // let deviceKey = 'tb)DPkFKpWJ5H7uL'
          // word的key
          // let deviceKey = '^4fSY0aUwPl8%Buv'
          //解密key
          // let _epubKeydecrypt = aes.decrypt(data.Data.Key,deviceKey)
          // let _tempUrl = data.Data.SplitFileUrls[0].toString()
          // let _tempUrl = data.Data.Url.toString()
          // let _tempUrl = '../../../static/epub/chapter14.xhtml'
          // let _tempU8 = new Uint8Array([80,75,3,4,20,0,0,0,8,0,135,136,118,73,111,97,171,44,22,0,0,0,20,0,0,0,8,0,0,0,109,105,109,101,116,121,112,101,75,44,40,200,201,76,78,44,201,204,207,211,79,45,40,77,210,174,202,44,0,0,80,75,3,4,10,0,0,0,0,0,142,136,118,73,0,0,0,0,0,0,0,0,0,0,0,0,4,0,0,0,79,80,83,47,80,75,3,4,20,0,0,8,8,0,73,147,249,76,184,206,83,25,247,45,1,0,16,50,1,0,19,0,36,0,79,80,83,47,99,104,97,112,116,101,114,49,52,46,120,104,116,109,108,10,0,32,0,0,0,0,0,1,0,24,0,161,226,16,237,1,36,212,1,161,226,16,237,1,36,212,1,161,226,16,237,1,36,212,1,132,91,67,140,40,138,162,27,219,182,109,219,182,109,219,182,109,219,182,109,235,140,109,219,54,254,91,223,205,223,55,233,166,109,154,52,165,60,145,50,194,145,54,69,50,102,181,12,222,127,236,92,92,179,236,28,128,139,58,203,138,186,148,20,142,101,222,226,86,97,173,169,213,9,86,229,193,220,2,155,128,4,1,119,20,83,150,4,98,195,31,241,241,22,78,220,212,252,245,223,236,255,94,0,105,154,20,9,216,199,198,15,85,5,236,19,75,62,63,111,90,85,91,142,40,87,188,64,219,109,0,48,17,120,200,127,189,172,36,237,174,161,12,161,53,53,86,238,4,62,111,64,130,38,49,207,58,185,86,195,76,24,71,180,32,224,250,179,156,116,244,132,109,45,100,239,231,168,160,214,96,193,137,215,240,213,193,192,51,46,109,27,72,18,65,98,143,195,222,182,178,93,185,153,125,205,65,192,169,227,205,62,70,34,221,47,235,44,156,254,190,195,166,65,76,15,76,254,39,103,152,88,89,217,193,99,25,88,194,18,190,253,142,196,77,166,178,181,208,119,55,204,240,120,83,143,219,60,240,234,200,184,39,252,117,210,91,221,235,16,240,122,226,55,111,80,106,35,99,17,204,11,129,216,19,78,241,51,76,2,167,139,180,11,86,158,109,19,114,178,43,69,205,126,53,91,111,162,209,103,169,18,134,40,58,244,73,214,40,35,232,88,130,0,96,169,89,200,227,20,141,195,25,252,192,81,79,144,249,32,31,60,67,55,27,109,229,17,227,18,16,167,158,56,249,197,172,136,130,170,205,205,166,105,198,77,197,43,153,42,50,69,100,188,161,3,199,192,110,207,207,202,85,6,209,13,181,21,31,226,88,179,217,241,101,189,171,44,48,122,190,160,251,164,236,160,242,11,231,75,180,84,250,185,180,48,116,9,179,122,99,200,247,180,25,58,147,44,38,80,67,202,61,129,78,11,117,192,182,56,230,203,178,74,160,223,179,195,13,253,84,254,195,35,4,95,123,105,244,28,106,140,171,43,137,74,51,174,220,221,160,19,82,12,38,57,177,86,90,237,92,0,242,156,15,159,25,228,55,65,11,202,25,8,160,29,193,247,137,224,172,156,27,229,24,238,119,161,174,135,220,118,250,91,209,154,153,211,162,95,100,35,225,163,217,16,44,239,105,34,118,240,246,177,153,105,168,217,205,177,244,76,47,229,24,167,150,132,197,164,68,136,36,244,163,79,237,19,122,41,187,147,107,143,60,141,12,168,8,229,127,235,154,177,127,254,233,117,42,119,221,146,18,49,42,0,211,18,24,163,154,28,73,92,39,127,254,39,15,159,129,176,29,73,41,157,188,232,29,159,139,66,56,145,190,43,61,164,101,145,109,88,211,29,157,102,171,113,164,53,244,117,232,2,60,134,118,52,33,219,31,52,108,20,90,207,249,175,240,181,101,178,215,1,98,167,140,55,91,252,173,77,25,16,77,181,49,219,49,217,31,152,39,16,229,39,220,81,251,181,188,245,213,223,84,52,225,91,132,123,236,116,60,14,178,167,0,136,208,4,2,32,133,88,61,0,224,64,190,241,18,72,166,234,53,255,114,134,168,32,81,167,56,118,230,66,245,163,7,1,158,17,202,87,55,203,187,48,40,222,54,250,202,38,34,245,159,23,49,65,248,38,165,111,13,161,235,99,7,208,173,149,138,52,12,26,173,15,236,98,183,124,253,141,88,14,93,95,188,195,142,136,172,103,25,174,111,87,34,78,187,51,43,145,38,244,76,185,132,57,73,93,70,224,14,145,203,1,123,192,23,84,172,243,173,219,195,61,158,7,231,170,224,94,95,191,202,217,90,146,7,117,38,14,164,192,139,49,7,146,68,213,53,174,90,94,242,86,17,191,250,119,201,187,228,142,203,152,188,86,89,154,131,204,88,181,182,178,252,108,45,203,107,160,188,216,172,152,81,186,97,52,105,98,100,227,56,3,113,177,33,86,255,221,153,101,59,227,75,132,214,119,60,21,109,140,65,41,151,26,173,13,192,66,11,202,113,132,216,153,26,245,145,91,87,34,97,216,1,179,200,136,18,237,183,216,148,2,248,132,140,55,230,227,232,106,39,128,241,52,210,36,86,52,85,164,119,229,79,221,18,97,89,23,88,164,93,191,180,88,19,169,146,174,16,205,241,168,151,124,3,11,113,183,77,105,10,216,179,31,94,23,75,93,6,162,7,35,20,77,0,139,83,200,201,230,43,107,220,213,121,179,94,84,144,249,162,148,73,176,204,129,134,125,38,170,23,197,41,166,73,98,217,32,173,72,99,175,234,113,79,251,159,5,131,169,209,225,238,154,175,2,245,87,61,137,233,102,176,154,35,74,157,47,190,131,142,72,143,250,191,102,57,207,82,6,7,219,220,13,175,69,18,159,72,126,188,22,57,148,36,27,94,193,183,147,215,80,159,13,98,162,86,163,206,138,76,186,204,30,20,77,11,234,135,239,103,8,57,26,136,41,129,130,125,126,163,141,106,35,92,198,73,179,152,69,122,4,137,192,223,97,171,135,21,73,130,134,95,205,77,245,243,68,94,172,122,60,228,79,79,6,56,249,70,54,210,9,14,226,104,66,220,175,56,75,45,207,19,53,60,206,124,62,84,106,5,187,42,150,187,247,181,225,138,243,19,135,104,85,109,52,3,212,98,152,154,28,112,243,16,99,230,212,228,1,233,67,243,99,180,204,49,67,103,50,135,163,149,48,33,37,44,134,26,233,8,50,240,98,114,128,204,170,54,13,39,15,246,233,93,230,194,152,57,70,138,133,51,254,135,171,85])
          // let _tempU8 = new Uint8Array([41,229,74,98,28,75,101,18,99,53,105,131,224,242,185,210,215,105,185,192,14,138,231,154,138,234,73,67,141,51,219,59,84,53,172,173,92,131,85,60,25,219,6,200,9,4,7,113,70,83,73,2,54,31,196,124,123,67,145,218,89,254,127,218,191,252,209,4,178,201,68,128,224,27,31,133,85,1,190,70,147,232,232,178,214,86,212,136,167,81,233,22,222,176,0,100,64,241,159,246,234,169,37,187,172,41,132,45,101,99,83,185,3,232,176,18,11,36,103,154,229,236,86,25,144,199,17,104,32,58,255,105,201,113,121,13,181,161,55,191,56,168,43,88,52,28,143,88,125,92,24,30,99,165,182,192,146,68,18,55,142,27,220,106,109,213,237,206,246,156,16,28,174,61,155,228,18,37,224,166,185,161,204,252,239,27,44,17,151,129,147,203,78,97,145,169,169,184,60,105,129,164,52,135,220,248,18,59,38,84,219,209,190,239,195,48,242,237,175,29,179,192,246,113,49,223,67,251,229,189,171,189,112,128,246,229,126,208,96,165,108,76,104,131,61,8,17,188,135,40,253,195,36,14,93,18,222,6,167,155,108,132,229,222,74,43,55,235,206,175,100,88,190,105,84,134,17,69,194,250,38,177,76,65,113,164,16,0,105,89,161,60,114,139,28,57,131,241,56,175,32,153,241,79,131,205,46,206,139,106,120,140,116,128,142,87,145,201,251,51,81,20,21,91,59,54,89,102,59,42,61,73,149,68,202,34,99,217,92,14,48,55,111,63,53,58,166,8,187,10,219,143,132,113,172,218,184,251,107,222,83,64,197,232,209,93,243,83,112,84,254,14,125,34,211,165,250,211,209,194,234,12,214,237,97,62,243,218,133,205,147,70,64,172,37,59,200,23,45,10,225,54,210,198,125,52,214,32,95,188,221,59,11,243,167,253,60,66,15,173,234,98,244,133,99,29,93,73,21,44,199,83,187,176,92,132,163,6,73,200,215,165,171,115,160,4,244,159,15,153,130,126,200,45,5,57,129,0,91,136,62,250,16,115,83,157,138,113,135,126,233,87,94,19,182,230,254,168,181,153,156,180,95,162,108,72,124,89,176,131,79,121,100,70,225,247,249,218,153,97,89,187,56,211,244,47,74,113,142,86,146,26,50,82,33,18,66,253,95,43,124,133,234,77,221,157,111,19,204,19,1,81,10,127,238,117,152,224,232,250,122,230,78,236,180,148,136,197,64,12,180,129,140,85,147,137,35,174,79,232,255,79,15,152,16,220,137,41,75,147,210,123,143,157,20,33,200,151,222,75,194,90,104,155,97,172,187,139,150,109,88,227,90,194,251,226,116,3,198,22,227,200,77,191,130,195,98,133,175,57,203,161,246,180,201,189,112,8,221,166,61,155,71,247,182,83,1,22,85,177,155,113,147,127,3,60,129,20,253,135,113,91,246,167,181,246,127,101,69,144,252,68,59,198,230,199,142,9,188,160,2,33,100,8,0,148,35,87,128,0,225,79,177,234,2,76,170,246,159,234,205,34,160,145,92,163,141,205,233,85,249,188,16,15,49,10,125,93,154,123,161,130,143,109,139,235,108,136,149,203,122,35,32,135,218,41,125,172,33,117,242,184,2,238,106,84,75,12,22,45,124,13,210,187,79,175,237,70,156,46,190,143,112,221,68,77,121,166,29,125,186,145,28,183,115,53,34,89,11,205,167,72,103,36,174,152,129,221,34,116,225,55,128,251,10,141,115,238,118,241,240,30,120,57,214,65,223,190,191,84,231,215,146,120,43,153,28,9,64,245,99,56,18,72,170,236,29,86,158,147,219,162,63,87,252,164,248,73,221,116,198,79,90,166,150,112,76,198,171,91,83,79,206,173,52,246,129,79,70,206,70,98,151,97,139,37,145,137,177,199,48,35,163,97,26,191,239,231,105,183,49,245,136,90,252,143,42,45,140,96,165,58,86,45,108,0,209,180,20,228,136,70,231,86,43,227,118,186,145,33,134,225,51,68,196,82,45,252,70,202,80,7,200,76,123,25,242,197,214,185,0,99,204,18,201,26,139,42,137,123,169,253,174,211,33,166,186,6,137,110,191,75,70,178,37,82,93,66,44,228,197,122,79,176,52,35,187,108,165,148,6,244,126,30,186,52,174,152,17,120,49,10,44,128,52,114,132,229,218,246,53,142,235,232,179,94,138,130,103,210,74,100,131,76,225,88,111,153,21,122,40,230,25,100,145,166,193,45,68,177,189,85,228,188,183,255,104,48,101,98,226,222,215,125,80,43,251,175,36,101,218,131,86,113,20,174,125,31,112,92,68,188,87,203,179,78,121,165,48,112,109,157,217,122,210,36,124,137,63,30,180,78,20,146,108,61,65,247,229,246,133,124,217,35,34,181,98,185,168,153,46,153,188,20,89,104,43,241,252,244,8,78,44,8,202,64,160,224,63,98,217,171,98,29,49,201,102,140,210,47,16,72,129,254,195,106,241,213,73,32,176,254,89,218,87,232,145,61,26,175,30,19,250,121,48,14,79,177,54,37,200,56,35,139,33,29,251,142,105,90,121,229,86,30,57,159,62,21,43,80,110,170,52,239,248,215,195,168,232,229,112,139,85,91,22,96,21,163,12,172,156,7,103,132,99,51,149,147,192,75,226,103,228,22,153,198,97,115,38,112,227,213,134,66,82,26,48,172,75,136,38,7,163,39,0,153,170,182,88,114,120,55,204,222,51,161,140,207,49,40,209,231,63,241,235,214,64,235,127,24,52,40,119,165,70,164,140,120,11,17,29,217,157,106,26,41,211,181,134,71,134,18,77,153,127,144,41,207,195,35,127,253,212,138,137,3,228,30,41,51,195,235,236,236,61,16,127,163,233,207,88,37,225,155,148,240,219,122,136,106,218,16,90,240,191,20,109,47,124,92,60,207,46,97,206,47,138,82,144,136,124,27,215,132,107,190,17,238,61,156,87,137,253,72,174,46,211,30,28,68,224,176,6,182,136,96,144,201,154,212,98,30,122,127,206,156,74,206,255,122,100,40,47,87,198,108,79,152,143,226,54,237,128,226,2,225,151,239,90,112,61,235,156,48,171,166,250,131,138,80,8,152,113,21,65,218,220,109,98,19,33,152,148,170,248,22,130,145,252,39,27,236,79,232,47,83,204,213,227,2,150,33,43,211,85,107,116,82,128,180,92,249,110,164,182,231,190,229,122,134,86,111,54,202,211,80,39,204,26,251,133,162,90,127,141,128,79,196,68,163,182,2,91,247,17,192,101,12,141,162,160,200,70,98,78,244,120,199,188,105,149,73,158,141,249,148,167,246,68,84,53,24,228,115,13,222,85,157,33,187,162,191,231,253,72,133,93,68,112,61,37,205,244,114,189,13,132,144,21,186,18,77,71,21,118,180,7,148,156,21,178,246,108,22,242,202,149,212,115,226,250,209,36,70,127,80,125,252,151,138,6,88,149,75,44,67,116,45,88,117,158,224,14,190,234,233,44,149,14,2,168,26,118,221,179,23,233,74,53,176,26,93,57,47,197,67,103,18,152,225,78,109,243,59,66,39,96,72,65,88,66,129,242,145,254,50,190,219,51,229,205,180,6,161,166,192,115,160,241,142,33,93,138,59,249,39,72,101,218,10,131,102,95,228,151,240,184,192,225,176,111,17,124,141,30,58,209,237,129,55,210,206,241,208,82,175,122,61,174,211,161,244,132,132,243,109,10,15,199,192,110,77,51,27,181,188,159,79,23,15,16,187,152,1,1,121,194,154,155,63,185,79,25,28,65,137,7,90,165,78,65,72,209,37,192,156,122,86,57,12,219,200,1,172,102,87,137,175,96,219,93,166,155,203,226,120,24,60,192,96,102,244,113,101,234,222,87,164,119,136,106,62,246,53,39,252,36,118,221,154,39,88,160,211,115,124,98,231,35,152,202,55,245,15,108,234,83,133,128,38,245,125,90,40,206,56,147,120,62,113,136,244,99,191,91,33,5,130,9,88,236,40,29,115,108,162,65,112,166,196,56,214,182,127,213,139,78,129,119,232,17,81,162,121,56,232,106,224,115,209,60,45,214,66,251,219,39,26,255,20,163,243,193,13,7,26,192,154,108,156,235,223,125,232,217,191,168,25,227,90,198,108,32,150,145,233,125,121,10,146,236,21,73,205,246,214,55,73,66,87,34,45,184,73,81,228,239,66,177,207,140,125,192,141,206,154,80,188,187,113,160,114,95,198,52,180,177,180,143,100,106,139,208,123,68,100,242,173,65,36,209,152,70,120,169,192,252,121,54,51,182,0,115,69,156,168,82,49,147,143,133,181,12,233,189,252,7,55,88,178,48,237,177,58,19,161,47,245,8,250,162,181,87,8,20,25,197,151,86,63,109,220,132,246,30,152,247,14,182,103,145,92,151,243,180,67,60,22,45,48,176,16,188,81,55,148,231,155,17,27,202,62,186,100,157,208,213,146,153,33,73,29,107,6,12,232,202,170,69,71,197,163,108,85,60,84,114,100,104,167,172,143,186,153,176,236,171,198,185,195,175,61,177,191,246,255,6,46,198,40,105,213,202,103,216,145,55,227,5,121,140,81,164,170,0,254,53,213,141,42,141,76,182,15,132,2,162,255,204,239,31,104,43,161,199,217,67,32,97,10,144,194,236,66,227,42,151,230,138,69,159,53,32,229,229,197,48,71,115,250,146,34,130,101,220,116,152,208,187,202,151,27,59,253,32,68,136,135,122,28,180,64,202,209,219,190,171,123,28,210,179,6,218,42,28,110,223,56,69,91,144,99,8,231,90,233,64,231,119,101,64,64,58,57,75,160,58,127,157,237,121,134,98,251,242,187,135,108,232,64,151,97,251,22,1,87,148,239,247,103,118,176,142,243,252,150,207,214,8,215,225,96,76,225,238,88,162,4,84,159,44,102,153,17,129,95,24,72,245,44,246,116,150,189,0,231,26,126,195,189,62,112,218,131,68,52,115,49,28,121,28,99,30,239,111,34,189,222,247,173,117,5,130,110,6,196,102,196,37,240,105,171,239,152,142,49,200,242,81,146,234,36,55,155,4,10,157,94,234,130,247,105,31,70,147,55,48,86,132,123,96,34,59,18,43,169,249,130,108,86,223,99,214,122,38,23,32,50,142,48,9,161,66,138,82,188,75,199,220,116,80,74,218,66,205,17,37,154,32,240,100,249,34,34,65,1,46,40,152,197,160,237,40,156,183,103,184,156,160,239,168,255,158,164,52,159,77,27,206,165,23,76,248,71,12,153,202,104,119,114,201,239,71,49,4,104,204,193,247,142,118,39,100,52,192,119,51,217,255,134,198,43,3,20,203,64,75,117,52,58,214,194,233,49,107,129,220,31,196,235,158,54,49,152,105,219,237,13,114,247,219,245,172,146,122,92,200,143,113,34,146,249,249,227,106,166,209,165,134,113,142,185,126,161,127,107,42,245,104,160,97,93,249,166,163,23,218,153,199,235,185,187,8,216,175,228,52,25,169,69,93,51,199,252,0,30,17,248,160,40,103,179,134,236,59,194,252,61,96,59,44,148,103,230,188,133,36,163,241,17,74,22,235,89,246,21,1,153,235,19,79,26,182,100,145,144,170,1,113,255,180,222,45,122,136,251,23,28,146,68,69,38,180,121,239,222,210,193,200,166,88,83,167,134,108,7,10,25,101,240,126,33,120,30,141,3,88,199,110,211,150,163,149,74,42,248,170,120,57,134,227,42,128,44,184,228,150,233,89,174,112,193,221,130,162,34,245,111,240,231,229,99,183,124,202,181,43,133,180,105,163,106,109,126,162,19,111,192,150,17,240,248,213,183,200,69,172,241,76,60,21,95,213,136,253,101,103,75,212,198,123,69,233,167,214,138,112,133,247,108,142,232,6,108,144,62,103,85,66,249,111,38,38,102,55,75,249,229,35,163,178,149,244,53,69,168,6,86,63,132,139,16,44,103,173,247,209,104,230,199,67,142,87,161,97,197,7,73,97,0,147,177,174,66,117,39,223,252,164,25,235,128,9,64,209,31,62,222,41,216,113,150,35,250,67,87,41,53,70,138,114,69,55,61,253,21,45,122,92,117,176,80,170,64,96,169,8,161,134,11,160,47,164,31,167,75,101,118,220,217,136,123,68,224,180,77,126,73,47,163,103,62,162,156,155,238,72,166,158,38,183,23,10,179,216,7,177,187,125,6,82,202,224,127,148,98,195,116,172,118,101,162,179,148,35,40,212,29,12,78,241,167,45,16,251,248,83,215,227,211,252,253,237,201,113,144,36,226,122,81,247,39,103,24,193,93,135,250,175,34,239,202,212,158,215,251,232,51,228,141,118,179,238,3,252,183,139,22,12,122,146,199,2,130,64,154,4,110,223,116,154,37,200,197,82,81,46,95,148,14,160,193,137,86,237,233,97,49,13,170,27,34,39,127,168,115,205,118,27,197,144,129,97,37,73,140,199,7,44,46,183,116,181,69,219,22,166,139,85,227,197,142,92,253,45,220,196,134,134,229,67,151,207,204,220,32,42,97,151,232,187,193,51,14,80,184,20,17,230,136,93,123,76,37,68,189,226,33,129,249,225,193,142,138,11,246,132,47,60,77,17,163,61,180,249,43,168,12,0,5,215,55,137,226,100,131,225,53,48,219,182,34,175,41,185,124,105,32,120,58,96,0,110,58,93,7,104,168,247,5,47,173,253,218,224,62,54,45,187,52,189,112,126,33,40,170,101,253,192,195,26,198,29,17,205,138,70,234,104,206,47,184,92,227,69,66,180,105,112,182,76,90,66,169,56,171,71,246,253,214,1,98,236,147,180,128,10,149,54,168,28,55,148,199,248,15,98,241,151,1,193,102,224,214,5,32,198,183,147,134,249,232,202,101,9,102,25,44,17,248,86,131,12,167,109,197,235,100,53,96,35,83,112,219,49,7,229,174,120,170,121,149,248,193,28,97,47,96,237,175,148,67,217,7,219,49,65,196,86,155,65,216,211,236,24,33,125,218,158,78,106,230,39,179,114,119,150,186,127,159,199,219,250,199,82,201,148,60,36,86,33,204,136,88,174,217,96,113,182,45,109,58,60,109,208,46,79,71,153,90,64,58,238,19,188,71,101,182,59,119,24,131,178,3,52,205,106,88,227,81,176,66,89,217,134,141,8,162,190,56,138,181,214,202,77,5,89,23,231,173,143,202,233,131,103,40,20,49,187,191,185,115,207,18,39,104,94,112,178,182,192,31,146,247,141,243,131,14,140,16,20,204,21,94,220,247,57,198,55,158,65,226,27,61,35,239,181,26,11,164,86,236,250,147,84,45,194,206,8,249,246,196,201,20,239,215,114,199,0,87,197,128,237,81,191,183,200,92,170,228,192,191,24,0,149,35,79,139,254,156,11,46,154,193,86,203,0,75,151,97,11,118,166,190,31,79,145,164,244,11,96,107,122,50,113,221,165,146,235,248,157,93,125,9,213,211,33,146,75,97,114,10,22,195,71,141,109,244,185,100,231,159,198,192,133,249,25,253,57,242,92,219,47,242,52,185,102,201,34,174,45,65,240,203,254,148,199,34,13,128,211,228,62,239,250,77,230,152,186,42,143,20,36,156,39,79,200,49,115,108,168,2,246,159,139,184,94,48,232,154,42,95,106,107,71,210,117,214,28,41,240,165,198,201,192,190,91,231,90,60,211,185,237,77,115,198,237,44,150,108,135,3,156,83,141,233,241,146,162,34,137,144,4,158,152,229,227,41,141,167,11,248,43,204,178,47,247,39,103,24,193,93,135,250,175,34,239,202])
          // let _tempUint8 = window.btoa(String.fromCharCode.apply(null, _tempU8))
          // let _u8Decrypt = aes.decrypt(_tempUint8,deviceKey)
          
          // let epubContent = ""
          // let zip = new JSZip()

          // zip.file(_tempUrl)
          
          // zip.generateAsync({
          //     type: "blob",
          //     compression: "STORE"
          // })
          // .then(res => {
          //   console.log(res,'文件流')
          // })

          // console.log(_tempUint8,'丢给word的_tempUint8')
          // console.log(zip.file(_tempUrl),'zip.file(_tempUrl)')
          // console.log(_tempUrl,'_tempUrl')
          // console.log(data.Data.Key,'发送请求返回的加密key')
          // console.log(_u8Decrypt,'解密后的word')
          // console.log(_epubKeydecrypt,'解密后的key')
        }
      })
      // var zip = new JSZip()
      // zip.file(http://demo.cabpv2.api.kingchannels.cn/files/test/源文件.epub")
      // zip.generateAsync({
      //     type: "uint8array",
      //     compression: "DEFLATE"
      // })
      // .then(res => {
      //   console.log(res,'res')
      // })
    },
    /**
     * 载入 epub
     */
    epubLoad () {
      
      let _that,_Store,_key,_stored,_ul,_Uint8Array
      
      _that = this
      _Store = _that.$store

      // _Store.commit(SET_EPUB_BOOK,'http://demo.cabpv2.api.kingchannels.cn/files/encrypted/2c0/6dfe60feebd24297b1052bc65452715e_0_654595_encrypted.epub')
      // _Store.commit(SET_EPUB_BOOK,'http://demo.cabpv2.api.kingchannels.cn/files/test/源文件.epub')
      _Store.commit(SET_EPUB_BOOK,'http://demo.cabpv2.api.kingchannels.cn/files/encrypted/2c0/6dfe60feebd24297b1052bc65452715e_0_654595_encrypted.epub')

      
      

      // _that.rendition.hooks.render.register(contents => { 
        
      //   // let _tempHTML = document.getElementById('ePubArea')[0]
      //   // _that.displayed = _that.rendition.display('chapter14.xhtml#Ac44c5814-9e83-47e0-b00f-03c913cab8b9')
      //   console.log(contents)
      // });

      // console.log(_Store.state.ePubBook,'_Store.state.ePubBook')


      _Store.state.ePubBook.ready.then(res => {    
        
        if (_Store.state.ePubBook.archive) {
         
          let epubZip = _Store.state.ePubBook.archive.zip
          let _deviceKey,_tempUint8,_u8Decrypt,_getU8
          let _epubXHTML = epubZip.folder("OPS").file("chapter14.xhtml").async('uint8array')

          _epubXHTML.then(u8 => {
              
            if (u8) {
              _tempUint8 = window.btoa(String.fromCharCode.apply(null, u8))
          
              _deviceKey = '^4fSY0aUwPl8%Buv'

              _u8Decrypt = aes.decrypt(_tempUint8,_deviceKey)

              // wrodArray to Uint8Array
              _getU8 = aes.stringify(_u8Decrypt)
            }
            
            //未解密直接渲染u8流程
            // _that.rendition.display(u8)

            // console.log(u8)

            //正确得到解密的流文件

          })

          //渲染对象
          _that.rendition = _Store.state.ePubBook.renderTo("ePubArea",{width: "100vw"}) 

          //渲染时做些什么事
          // _that.rendition.hooks.content.register((contents,view) => {
          //   console.log(contents)
          //   let body = document.getElementsByTagName(html)
            
          //   // let _tempHTML = document.getElementById('ePubArea')[0]
          //   // _that.displayed = _that.rendition.display('chapter14.xhtml#Ac44c5814-9e83-47e0-b00f-03c913cab8b9')
          // });

          _that.rendition.display()

          // 默认使用什么样式，主要是处理图版显示超出版边的问题
          // _that.rendition.themes.default({
          //   img:{
          //     'width':'100% !important'
          //   },
          //   h2: {
          //   'font-size': '32px',
          //   color: 'purple'
          //   },
          //   p: {
          //     "margin": '10px'
          //   }
          // })

          // console.log(_u8Decrypt)

          // _Uint8Array =  _Store.state.ePubBook.archive.zip.files["OPS/chapter14.xhtml"]._data.compressedContent
          
          // let _temp = [41,229,74,98,28]
          // let _temp = aes.str2ab([41,229,74,98,28,75,101,18,99,53,105,131,224,242,185,210,215,105,185,192,14,138,231,154,138,234,73,67,141,51,219,59,84,53,172,173,92,131,85,60,25,219,6,200,9,4,7,113,70,83,73,2,54,31,196,124,123,67,145,218,89,254,127,218,191,252,209,4,178,201,68,128,224,27,31,133,85,1,190,70,147,232,232,178,214,86,212,136,167,81,233,22,222,176,0,100,64,241,159,246,234,169,37,187,172,41,132,45,101,99,83,185,3,232,176,18,11,36,103,154,229,236,86,25,144,199,17,104,32,58,255,105,201,113,121,13,181,161,55,191,56,168,43,88,52,28,143,88,125,92,24,30,99,165,182,192,146,68,18,55,142,27,220,106,109,213,237,206,246,156,16,28,174,61,155,228,18,37,224,166,185,161,204,252,239,27,44,17,151,129,147,203,78,97,145,169,169,184,60,105,129,164,52,135,220,248,18,59,38,84,219,209,190,239,195,48,242,237,175,29,179,192,246,113,49,223,67,251,229,189,171,189,112,128,246,229,126,208,96,165,108,76,104,131,61,8,17,188,135,40,253,195,36,14,93,18,222,6,167,155,108,132,229,222,74,43,55,235,206,175,100,88,190,105])
          // let _tempArray = new Uint8Array(_temp)
          // console.log(_temp,'_temp')
          // console.log(_Uint8Array[2],'_tempTest')
          // _temp2通过解析方法转成WordArray,返回未命名的words
          // let _temp4 = aes.Uint8ArrayToString(_temp)
          // _temp2通过CryptoJS转WordArray,返回WordArray.init的words
          // let _temp2 = aes.encrypt(_tempArray,"^4fSY0aUwPl8%Buv")
          // 通过encript转成base64
          // let _temp2 = aes.encrypt(_temp,'^4fSY0aUwPl8%Buv')
          // 通过btoa转成base64，这是还是2进制
          // let _temp3 = aes.decrypt(_temp2,'^4fSY0aUwPl8%Buv')
          // console.log(_Uint8Array,'_Uint8Array')
          // console.log(_temp2,'Int8Array')
          // console.log(_temp2,'encrypt')
          // console.log(_temp4,'Int8parse')
          // console.log(_temp3,'decrypt')
          // console.log(window.atob(_temp3),'decrypt')
          // console.log(aes.ab2str(_temp),'aes.ab2str')
        }
      })

      // book.spine.hooks.serialize // Section is being converted to text
      // book.spine.hooks.content // Section has been loaded and parsed
      // rendition.hooks.render // Section is rendered to the screen
      // rendition.hooks.content // Section contents have been loaded
      // rendition.hooks.unloaded // Section contents are being unloaded
      
      // _Store.state.ePubBook.ready.then(books => {
      //   let meta = _Store.state.ePubBook.package.metadata; // Metadata from the package json
      //   let toc = _Store.state.ePubBook.navigation.toc; // Table of Contents
      //   let landmarks = _Store.state.ePubBook.navigation.landmarks; // landmarks
      //   let spine = _Store.state.ePubBook.spine; // landmarks
      //   let cover = _Store.state.ePubBook.cover; // landmarks
      //   let resources = _Store.state.ePubBook.resources; // landmarks
      //   let pageList = _Store.state.ePubBook.pageList; // page list (if present)

      //   _Store.state.ePubBook.loaded.manifest.then((manifest) => { console.log(manifest) });
      //   _Store.state.ePubBook.loaded.spine.then((spine) => { console.log(spine) });
      //   _Store.state.ePubBook.loaded.metadata.then((metadata) => { console.log(metadata) });
      //   _Store.state.ePubBook.loaded.cover.then((cover) => { console.log(cover) });
      //   _Store.state.ePubBook.loaded.navigation.then((navigation) => { console.log(navigation) });
      //   _Store.state.ePubBook.loaded.resources.then((resources) => { console.log(resources) });
      // })

      _Store.state.ePubBook.ready.then(res => {
        Indicator.close()
        _key = _Store.state.ePubBook.key()+'-locations';
        _stored = localStorage.getItem(_key);
        // console.log(res,'res')
        if (_stored) {
				 return _Store.state.ePubBook.locations.load(_stored);
        } else {
          return _Store.state.ePubBook.locations.generate(1600);
        }
      })
      // .then(locationsCfi => {
      //   // console.log(locationsCfi,'locationsCfi')
      // })

      // _that.rendition.on("relocated", function(location){
      //   console.log(location,'asdc');
      // });
      // _Store.state.ePubBook.loaded.navigation.then(function(toc){
      //   console.log(toc)
      // })
      //目录
      _Store.state.ePubBook.loaded.navigation.then(getToc => {
         
        let _ul = document.getElementById('toc'),
            _docfrag = document.createDocumentFragment()
        // console.log(getToc.parse(),'getToc.get()')
        getToc.toc.forEach((chapter,index) => {
          console.log(chapter,'console.log(chapter)') 
          //新建li标签
          let _item = document.createElement("li"),
          //新建a标签
          _link = document.createElement("a")
          //给a标签添加id名
          _link.id = "chap-" + chapter.id
          //给a标签添加label
          _link.textContent = chapter.label
          //把chapter的链接赋值给a标签
          _link.href = chapter.href
          //添加到li里
          _item.appendChild(_link)
          _docfrag.appendChild(_item)
          _link.onclick = function () {
            let _url = _link.getAttribute("href");
            _that.rendition.display(_url)
            return false
          }
        })
        _ul.appendChild(_docfrag)
      })
      //默认样式
      
      // console.log(_Store.state.ePubBook,'_Store.state.ePubBook')
    },
    testAES () {
      let zip = new JSZip()
      zip.file("../../../static/epub/chapter14.xhtml");
      console.log(zip,'zip')
    },
    /**
     * 下一页
     * @author 李啸竹
     */
    ePubNext () {     
      this.rendition.next()
    },
    /**
     * 上一页
     * @author 李啸竹
     */
    ePubPrev () {
      this.rendition.prev();
    },
    /**
    * 返回追更新的书本id
    * @author 李啸竹
    */
    getBookList () {
      let localShelf = util.getLocalStroageData('followBookList')
      let bookListArray = []
      for (let bookId in localShelf) {
        bookListArray.push(bookId)
      }
      return bookListArray
    },

    getBookUpdate () {
      let localShelf,
        that = this
      Indicator.open()
      api.getUpdate(this.getBookList()).then(response => {
        for (let i in response) {
          localShelf = util.getLocalStroageData('followBookList')
          response[i].then(book => {
            Object.assign(book.data, localShelf[book._id])
            book.data.cover = util.staticPath + book.data.cover
            that.books.push(book.data)

            Indicator.close()
          })
        }
      })
    },

    readbook (book) {
      this.$store.commit(SET_READ_BOOK, book)
      this.$store.commit(SET_CURRENT_SOURCE, book.source)
      this.$router.push('/readbook/' + book._id)
    },

    showDelBookBtn (e) {
      let target = e.target.parentElement
      while (target.className !== 'book-list') {
        target = target.parentElement
      }
      target.style.left = '-44vw'
    },

    hideDelBookBtn (e) {
      let target = e.target.parentElement
      while (target.className !== 'book-list') {
        target = target.parentElement
      }
      target.style.left = '0'
    },

    delBook ($event, index) {
      let storage = window.localStorage
      let localShelf = JSON.parse(storage.getItem('followBookList')) ? JSON.parse(storage.getItem('followBookList')) : {}
      // 删除该书籍在本地的缓存记录
      delete localShelf[this.books[index]._id]
      this.books.splice(index, 1)
      // 重新保存
      storage.setItem('followBookList', JSON.stringify(localShelf))
    }
  }
}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style lang="less" scoped>
div.epub-index-wrap {
  .headerHidden {
    background: #000;
    // transform: translateY(100%);
    // transition: all .3s ease-out;
  }
  div.boxHidden {
    transform: translateX(100%);
    transition: all .3s ease-out;
  }
  div#toc-wrap {
    position: fixed;
    top:0;
    right:0;
    z-index: 99;
    width:45%;
    height: 100%;
    padding:5%;
    background: rgba(255, 255, 255, .9);

    transition: all .3s ease-in;
    ul#toc {
      font-size: 14px;
      height: inherit;
    }
  }
  div#touch-wrap {
    position: fixed;
    top:0;
    height: 0;
    width:100vw;
    height: 100vh;
    z-index: 99;
    
    display: flex;
    flex-direction: row;

    div.l {
      width:25vw;
      height: inherit;
    }
    div.c {
      width:50vw;
      height: inherit;
    }
    div.r {
      width:25vw;
      height: inherit;
    }
    
  }
  div#ePubArea {
    position: fixed;
    top:0;
    left:0;
    width:100%;
    height: 100%;
    .clickHidden {
      display:none;
    } 
  }
  
  div.epub-btn-wrap {
    position: fixed;
    top:0;
    left:0;
    z-index: 1;
    
    div#ePubPrev,div#ePubNext {
      background:rgba(0, 0, 0, .1);
      width:25px;
      height: 125px;
      display: flex;
      justify-content: center;
      align-items: center;

      img {
        width: 15px;
        height: 15px;
      }
    }
    div#ePubPrev {
      position: fixed;
      top:40%;
      left:0;
    }
    div#ePubNext {
      position: fixed;
      top:40%;
      right:0;
    }
  }

  .add-book {
    position: absolute;
    top: 50%;
    left: 50%;
    transform: translate(-50%, -50%);
  }

  .add-book:focus {
    outline: none;
  }

  .book-shelf {
    width: 100vw;
    overflow: hidden;
    box-sizing: border-box;
    padding: .5rem 0 0 .5rem;
  }

  .book-list-wrap {
    position: relative;
    height: 5rem;
    margin-bottom: .2rem;
  }

  .book-list {
    position: absolute;
    left: 0;
    width: 140vw;
    display: flex;
    flex-direction: row;
    justify-content: space-between;
    margin-bottom: .2rem;
  }

  .book-list img {
    width:70px;
    height:100px;
    float: left;
    margin-right: .4rem;
  }

  .info {
    display: flex;
    flex-direction: column;
    justify-content: center;
    box-sizing: border-box;
    width: 65%;
    height: 5rem;
    margin-left: .6rem;
    border-bottom: 1px solid #f2f2f2;
  }

  .info p {
    margin-top: .2rem;
    margin-bottom: .2rem;
  }

  .updated {
    color: #6d6666;
    font-size: .8rem;
  }

  .del-book-btn {
    color: #fff;
    background: red;
    width: 40vw;
    line-height: 5rem;
    text-align: center;
  }

  .read-book-history {
    display: flex;
    width: 100vw;
  }
}
</style>
